Tour.org
* Intro
This document provides a tour of Alpaca's current capabilities and limitations in a bit more depth for anyone looking to use it.

Some of Alpaca's goals:

- A statically typed, strictly evaluated (eager, not lazy), and functional language for the Erlang platform.
- Infer types as much as possible so we only need to be explicit where it matters.
- A reasonably flexible approach to simple Algebraic Data Types (ADTs) .
- Interoperate with existing Erlang code and libraries as safely as possible.

** Helpful Foundations
If you're unfamiliar with Erlang itself, I'd highly recommend the excellent [[http://learnyousomeerlang.com/][Learn You Some Erlang for great good!]]  The sections on [[http://learnyousomeerlang.com/starting-out-for-real][the basic data types]] and on [[http://learnyousomeerlang.com/modules][modules]] will probably help a great deal to start understanding where Alpaca fits and what it does.

Much of Alpaca in its current state borrows (in an unstructured manner) aspects of a number of languages that descend from [[https://en.wikipedia.org/wiki/ML_(programming_language)][ML]] including:

- [[https://ocaml.org/][OCaml]]
- [[https://www.haskell.org/][Haskell]]
- [[http://elm-lang.org/][Elm]]

While you probably don't need to know any of them in detail, some of the syntax in this document might make a bit more sense if you're familiar with one of the above (including ML).

** About This Document
This document is exported from the Emacs org-mode doc ~Tour.org~ using ~org-md-export-to-markdown~.  Corrections and suggestions welcome via PRs to the main [[https://github.com/alpaca-lang/alpaca][Alpaca repository]].
* The Structure of a Program
Alpaca at present is really just a new way to write modules for an Erlang application.

** What Modules Include
The set of top-level elements permitted in a module are the following:

- a module declaration, e.g. ~module my_module_name~.  This is required.
- function exports.  These tell the compiler which functions should be publicly accessible to modules outside of the ones we write in Alpaca.
- type definitions.  These describe new types as ADTs.
- test cases
- comments, though these can go anywhere and are not restricted to the top level.
- functions.  These can contain other functions and variables inside of them.

Here's a simple example of a module:

#+BEGIN_SRC
module my_module

-- one function that takes a single argument will be publicly accessible:
export double/1

{- Our double function defines an "add" function inside of itself.
   Comments for now are C-style.
 -}
let double x =
  let add a b = a + b in
  add x x

test "doubling 2 is 4" = some_test_checker (double 2) 4

-- Basic ADT with type constructors:
type even_or_odd = Even int | Odd int

-- A function from integers to our ADT:
let even_or_odd x =
  let rem = x % 2 in
  match rem with
      0 -> Even x
    | _ -> Odd x
#+END_SRC
Note that variables and function names follow the same format, beginning with a lower-case character.
* Included Data Types
** The Basic Ones
*** Booleans
Just ~true~ and ~false~, not atoms as in Erlang although they're encoded as such after compilation.
*** Numbers
Alpaca has integers and floats which can't mix with each other at all.  They have separate arithmetic instructions as in OCaml:

#+BEGIN_SRC
1 + 2       -- integer
1.0 +. 2.0  -- float
1 +. 2      -- type error, +. is only for floats
1 +. 2.0    -- type error, can't mix integers and floats
#+END_SRC

*** Atoms
Atoms in Alpaca are just text prefixed with ~:~, e.g. ~:this_is_an_atom~ and ~:soIsThis1~. Quotes may be used if spaces or symbols are required, e.g. ~:"still an atom!"~.
*** Strings
Strings in Alpaca are all assumed UTF-8 and will be encoded as such:
#+BEGIN_SRC
"This is a string"
"so is 한국 and 日本"
#+END_SRC
These are compiled as binaries under the hood.  If you're looking for Erlang's basic string types, character lists can be constructed by prefixing a string with ~c~, for example:
#+BEGIN_SRC
c"character list!"
#+END_SRC
*** Binaries
If you're not familiar with binaries, there's some [[http://learnyousomeerlang.com/starting-out-for-real][good coverage]] of them in [[http://learnyousomeerlang.com/][Learn You Some Erlang...]]  At present in Alpaca they're a little more verbose but also a little more obvious, e.g.
#+BEGIN_SRC
<<"this text is assumed to be UTF-8">>
<<"But we can also be explicit": type=utf8>>

{- endian, sign, units and size all work, here's how we might encode
 * a 32-bit, big-endian, unsigned integer:
 -}
<<SomeInteger: type=int, size=8, unit=4, end=big, sign=false>>

-- of course we can just list off integers and floats too:
<<1, 2, 3.14, 4, 5, 6.0>>
#+END_SRC

Endian settings can be ~big~, ~little~, or ~native~ as in Erlang.
** The Polymorphic Ones
These types are all "parametrically polymorphic", or "generics" for those of us familiar with Java. This means that these types contain data of another type in a general manner so that we can have "a list of integers" and "a list of strings" without changing any of the code involving lists themselves.

*** Tuples
Tuples, like functions, have a specific arity (number of contained elements).  In Alpaca the typing of tuples covers both their arity *and* the type of each element.  Let's introduce pattern matching here to illustrate their structure:
#+BEGIN_SRC
let third my_tuple =
  match my_tuple with
    (_, _, x) -> x

let third_string my_tuple =
  match my_tuple with
    (_, _, x), is_string x -> x

third (1, 2, 3) -- will return the integer 3

{- The following will fail compilation with a type error because
 * third_string/1 only takes tuples that have strings as their
 * third element:
 -}
third_string (1, 2, 3)

{- Both of the following will also fail compilation since the function
 * third/1 requires tuples with exactly 3 elements:
 -}
third (1, 2)
third (1, 2, 3, 4)

{- This function will also fail to compile because tuples of arity 2
   and those of arity 3 are fundamentally different types:
 -}
let second_or_third my_tuple =
  match my_tuple with
      (_, _, x) -> x
    | (_, x) -> x

#+END_SRC
We can express the types of tuples with tuples themselves, for example ~(int, string)~ for tuples of integers and strings.
