Tour.md

### Lists<a id="sec-3-2-2" name="sec-3-2-2"></a>

Lists compile directly to Erlang lists but of course they're type-checked. This means, for example, that we aren't able to mix integers and floats in the same list without creating an ADT that covers them both.  We can express "list of strings" with the type `list string`.

We can build lists up with the cons operator `::` or as literals:

```elm
"end" :: "a" :: "cons'd" :: "list" :: "with the nil literal []" :: []
["or just put", "it", "in", "square brackets"]

-- type error:
[:atom, "and a string"]
```


Let's revisit pattern matching here as well with both forms:

```elm
let length my_list =
  match my_list with
      [] -> 0
    | _ :: t -> 1 + (length t)

let is_length_3 my_list =
  match my_list with
      [_, _, _] -> true
    | _ -> false
```


### Maps<a id="sec-3-2-3" name="sec-3-2-3"></a>

Maps are type-checked as lists are but have separate types for their keys vs their values.  If we wanted a map with atom keys and string values, it could be expressed as the type `map atom string`.  Functionality is relatively limited still but we can construct literal maps, add single key-value pairs to maps, and pattern match on them.

```elm
#{:key => "value"}  -- a literal

{- This will cause a type error because the types of the keys
  * don't match:
  -}
#{:key1 => "value 1", "key 2" => "value 2"}
```


### Records<a id="sec-3-2-4" name="sec-3-2-4"></a>

Records can be created ad-hoc wherever you like as in OCaml and Elm and you can pattern match on the structure of records as well.

```elm
{x=1, hello="world"}  -- a literal record

-- we have basic structural matching:
match {x=1, hello="world"} with
  {x=xx} -> xx

{- We have "row polymorphism" which means that if you call the following
    function with {x=1, hello="world"}, the return type does not lose the
    information about the hello field.  The return type of calling the
    function below with that record will be (int, {x: int, hello: string}).
-}
let x_in_a_tuple my_rec =
  match my_rec with
    {x=xx} -> (xx, my_rec)
```


1.  Record Transformations

    Records can be transformed and extended with the same syntax.  Alpaca doesn't consider these "updates" since the original record never changes.  If we wanted to add fields `x` and `y` to an existing record `rec`, it's pretty straightforward:

        let a_new_record = {x=1, y=2.0 | rec}

    Note that the original record `rec` has not changed, we have made an entirely new record that contains all of the fields in the original along with our new integer `x` field and the float `y` field.

    The same syntax can be used to replace a member.  If we wanted to replace `x` in the example `a_new_record` above, here's how we'd do it:

        {x=5 | a_new_record}

    What happens if we change the type of a field?

        -- {x: int, y: int}
        let rec1 = {x=1, y=2}

        -- {x: string, y: int}
        let rec2 = {x="hello!" | rec1}

    Remember that transforming a record actually makes an entirely new one so we allow for members to change type since it's not **actually** a mutation anyhow.   Thanks to <https://github.com/danabr> for the suggestion of "transformation" rather than "update".

    There are currently no plans to enable the removal of record fields.

2.  What's Row Polymorphism?

    The key thing we're after from row polymorphism is not losing information.  For example in Java if we had the following:

        public interface IHasX {
            public int getX();
        }

        public class HasXY implements IHasX {
            public final int x;
            public final String hello;

            public HasXY(int x, String hello) {
                this.x = x;
                this.hello = hello;
            }

            public int getX() { return x; }
            public String getHello() { return hello; }
        }

        public IHasX identity(IHasX i) {
            return i;
        }

    The return of `identity(new HasXY(1, "world"))` "loses" the information that the passed-in argument has a `hello` member of type `String`.

        let identity my_rec =
          match my_rec with
            {x=_} -> my_rec

    The return of `identity({x=1, hello="world"})` above is still the type `{x: int, hello: string}` in Alpaca  even though the function `identity` only cares about the field `x: int`.

3.  What's Missing?

    There's not yet a way to access individual fields of a record without pattern matching (e.g. `let my_rec = {x=1, hello="world"} in x.x`)

### PIDs<a id="sec-3-2-5" name="sec-3-2-5"></a>

Process identifiers (references to processes to which we can send messages) are typed with the kind of messages they are able to receive.  The type of process that only knows how to receive strings can be expressed as `pid string`.  We'll cover processes and PIDs in a bit more detail later but if you're unfamiliar with them from Erlang, [The Hitchhiker's Guide to Concurrency](http://learnyousomeerlang.com/the-hitchhikers-guide-to-concurrency) from Learn You Some Erlang is a great place to start.

# Functions<a id="sec-4" name="sec-4"></a>

Inside of a function we can define both immutable variables and new functions:

```elm
let f x =
  let double y = y + y in      -- this is a single argument function
  let doubled_x = double x in  -- a variable named "double_x"
  doubled_x + x                -- the expression returned as a result
```


As Alpaca is an expression-oriented language, there are no return statements.  Just as in Erlang, the final expression in a function is the value returned to the caller.  The type of a function or variable is entirely inferred by the type checker:

```elm
{- Because the body of this function multiplies the parameter by a float,
    the compiler knows that this function takes floats and returns floats
    (float -> float).  If we were to call this function with something other
    than a float (e.g. an integer or string), the compiler would fail with
    a type error.
-}
let double x = x *. 2.0
```


Type signatures can be set on top level functions and values, e.g.:

```elm
val add : fn int int -> int
let add x y = x + y
```

The signatures look a little different to the other MLs, while resembling OCaml the most; they are consistent with Alpaca's type definitions in ADTs. Another example, demonstrating polymorphic parameters:

```
val apply 'a 'b : fn (fn 'a -> 'b) a -> 'b
let apply f x = f x
```


Note the explicit listing of type variables `'a` and `'b` after the name of the signature, and that arguments are not separated by `->` but listed simply with a space between them, with the arguments separated from the return type by a single `->`. For fairly exhaustive examples of type signatures, please see `basic_signature_test.alp` in the test suite.

Most of the time, you can safely omit type signatures. They can be useful in getting early feedback from the compiler that your types infer as you expect. They are also useful in making generic, unbounded functions and types more specific (specialization). They are essential when writing functions that wrap `beam` FFI calls, where the inputs are always unbounded, e.g:

```elm
val print_string : fn string -> unit
let print_string str =
  beam :io :put_chars [str] with
  | _ -> ()
```


By forcing `print_string` to take only strings, we guard against passing types that Erlang's `io:put_chars` can't understand, preventing a runtime error.

While functions with no arguments aren't supported ("nullary" or arity of zero) we can use the unit term `()` if we don't need or want to pass anything specific.  Let's introduce the basic foreign function interface here to call an Erlang io function:

```elm
let print_hello () =
  beam :io :format ["Hello~n", []] with _ -> ()
```
