Tour.md


## The Foreign Function Interface<a id="sec-4-1" name="sec-4-1"></a>

The FFI is how we call any non-Alpaca code in the Erlang VM (e.g. Erlang, [Elixir](http://elixir-lang.org/), [LFE](http://lfe.io/), and more).  Since our compiler can't type-check other languages, we combine a call to another module and function with a set of pattern match clauses to figure out what the actual type is that we're returning from it.

Here we're using a simple guard function so that we know the FFI expression is returning characters (an Erlang string):

```elm
beam :io_lib :format ["This will contain the integer 3:  ~w", [3]] with
  cs, is_chars cs -> cs
```


The FFI `beam` expects the external module and function as atoms and then a list of arguments to send.  The arguments sent are **not** type checked but the return value in the pattern matching clauses **is** checked.

## Built-In Functions<a id="sec-4-2" name="sec-4-2"></a>

The basic infix comparisons are all available and can be used in pattern matching guards:

-   `==` for equality, compiles to `=:=`
-   `!=` for inequality
-   `>`, `<`, `>=`, and `<=`

Some simple examples:

```elm
1 == 1     -- true
1 == 2     -- false
1 == 1.0   -- type error
:a == :a   -- true
```


The basic arithmetic functions also exist, `+`, `-`, `*`, `/`, and `%` for modulo.  The base forms are all for integers, just add `.` to them for the float versions except for modulo (e.g. `+.` or `/.`).

Some other simple type checking functions are also usable in pattern match guards:

-   `is_integer`
-   `is_float`
-   `is_atom`
-   `is_bool`
-   `is_list`
-   `is_string`
-   `is_chars`
-   `is_pid`
-   `is_binary`

A word of caution:  strings are encoded as binaries, and chars as lists so if we call the following example `f/1` with a string, we will **always** get a binary back (assuming there's an ADT covering both):

```elm
let f x =
  match x with
      b, is_binary b -> b
    | s, is_string s -> s
```


And here we will always get a list instead of a character list (same ADT restriction):

```elm
let g x =
  match x with
      l, is_list l -> l
    | c, is_chars c -> c
```


## Currying<a id="sec-4-3" name="sec-4-3"></a>

Top level functions can be curried. Practically speaking, this means that if
you do not provide a function with all of its required arguments, it instead
returns another function that takes the remaining arguments. There are some
limitations to this:

-   If multiple versions of a function are defined, such as `f/2` and `f/3`,
    supplying a single argument to `f` would be ambiguous, so this is disallowed
-   Functions defined in `let... in...` bindings cannot (currently) be curried
-   When currying a function defined in another module, the function must first
    be explicitly imported, i.e. ~other<sub>module</sub>.my<sub>fun</sub> "hello"~ would not work,
    but ~import other<sub>module</sub>.my<sub>fun</sub>;; my<sub>fun</sub> "hello"~ would.

The latter two are limitations that should go away in future.

Some examples:

```elm
-- Currying means we can use a 'pipe forward' operator to 'chain' expressions
let (|>) x f = f x

let add a b = a + b
let sub a b = a - b

let result () =
  10 |> add 5 |> sub 2 |> add 19

-- We can create predicates for use with higher order functions, e.g.
let eq x y =
  x == y

-- assuming a filter/2 function that takens a predicate function and a list 'a
let filtered_list () =
  filter (eq 3) [1, 2, 3]
```


## Lambdas<a id="sec-4-4" name="sec-4-4"></a>

Lambdas (AKA anonymous functions) can be defined with the `fn` keyword:

```elm
fn x -> x + 1
```


They can also be bound to variable names, e.g. these two versions of `double` will produce the exact same output binary:

```elm
let double = fn x -> x + x

let double x = x + x
```


We can also use lambdas as arguments to other functions, here's an example of passing a function that adds 1 to each element of an integer list:

```elm
let example () =
  map (fn x -> x + 1) [1, 2, 3]

test "example should result in [2, 3, 4]" =
  assert_equal (example ()) [2, 3, 4]

-- here's a simple definition of the map function:
let map f [] = []
let map f (h :: t) = (f h) :: (map f t)
```


Finally, we can use the unicode lambda and right-arrow characters if we want to.  These two functions are identical:

```elm
λ x → x + 1

fn x -> x + 1
```


So the following would work the same as our `example` function above:

```elm
let example () =
  map (λ x → x + 1) [1, 2, 3]
```


# User Defined Types:  ADTs<a id="sec-5" name="sec-5"></a>

We can currently specify new types by combining existing ones, creating [algebraic data types (ADTs)](https://en.wikipedia.org/wiki/Algebraic_data_type).  These new types will also be inferred correctly, here's a simple example of a broad "number" type that combines integers and floats:

```elm
-- a union:
type number = int | float
```


We can also use "type constructors" and type variables to be a bit more expressive.  Type constructors start with an uppercase letter (e.g. `Like` `These`) and can have a single associated value.  Type variables start with a single apostrophe like 'this.  Here's a simple example of an option type that's also polymorphic/generic (like lists and maps):

```elm
{- `Some` has a single associated value, `None` stands alone.  Note that
    we have the type variable 'a here that lets us be particular about which
    items in the type's members are polymorphic.
-}
type opt 'a = Some 'a | None

{- Here's a map "get value by key" function that uses the new `opt` type.
    It's polymorphic in that if we give this function a `map string int`
    and a string for `key`, the return type will be an `opt int`.  If we
    instead give it a `map atom (list string)` and an atom for the key,
    the return type will be `opt (list string)`.
-}
let map_get key the_map =
  match the_map with
      #{key => value} -> Some value
    | _ -> None
```


We can use the basic Alpaca types as well, here's a type that describes parsed JSON data based on how the [JSX](https://github.com/talentdeficit/jsx) library represents it:

```elm
type json = int | float | string | bool
          | list json
          | list (string, json)
```


If the above type is in scope (in the module, or imported), the following function's type will be inferred as one from `json` to `atom`:

```elm
let f x =
  match x with
      i, is_integer i -> :integer
    | f, is_float f -> :float
```


If the inferencer has more than one ADT unifying integers and floats in scope, it will choose the one that occurs first.  In the following example, `f/1` will type to accepting `int_or_float` rather than `json`.

```elm
type int_or_float = int | float

type json = int | float | string | bool
          | list json
          | list (string, json)

let f x =
  match x with
      i, is_integer i -> :integer
    | f, is_float f -> :float
```
