Tour.org
* Tests
Support for tests inside source files is currently at its most basic with the goal of keeping unit tests alongside the functions they're testing directly rather than in a separate file.

Tests:

- can occur anywhere within a module
- are only compiled and exported if the compiler is told to run in test generation mode (the atom ~test~ given in its options)
- are run by [[http://erlang.org/doc/apps/eunit/chapter.html][EUnit]]
- fail if an error/exception is thrown in the test's expression

Here's a simple example:
#+BEGIN_SRC
let add x y = x + y

test "add 2 2 should result in 4" =
  add 2 2
#+END_SRC
While the above test is type checked and will happily be compiled, we lack assertions to actually *test* the call to add.  They can be built relatively simply for now, here's a full module example using a simple equality check from one of the test files, ~basic_module_with_tests.alp~:
#+BEGIN_SRC
module add_and_a_test

export add/2

let add x y = x + y

test "add 2 2 should result in 4" = test_equal (add 2 2) 4

{- Test the equality of two terms, throwing an exception if they're
   not equal.  The two terms will need to be the same type for any
   call to this to succeed:
 -}
let test_equal x y =
  match (x == y) with
      true -> :passed
    | false ->
        let msg = format_msg "Not equal:  ~w and ~w" x y in
        beam :erlang :error [msg] with _ -> :failed

-- formats a failure message:
let format_msg base x y =
  let m = beam :io_lib :format [base, [x, y]] with msg -> msg in
  beam :lists :flatten [m] with msg, is_chars msg -> msg
#+END_SRC

It's a bit of an open question right now as to whether we'll try to pull test assertions from EUnit's include file directly (likely the preferable way) or implement some matchers directly in Alpaca.
* Processes
Process support in Alpaca is still pretty basic but the following are all supported:

- spawn a function from the current module as a process with ~spawn~
- receive messages in a function with ~receive~
- send messages to process with ~send~

A basic example will probably help:
#+BEGIN_SRC

let a_counting_function x =
  receive with
      "add" -> a_counting_function x + 1
    | "sub" -> a_counting_function x - 1

{- If a_counting_function/1 is exported from the module, the following
   will spawn a `pid string`, that is, a "process that can receive
   strings".  Note that this is not a valid top-level entry for a module,
   we just want a few simple examples.
 -}
let my_pid = spawn a_counting_function 0

-- send "add" to `my_pid`:
send "add" my_pid

-- type error, `my_pid` only knows how to receive strings:
send :add my_pid
#+END_SRC

The type inferencer looks at the entire call graph of the function being spawned to determine type of messages that the process is capable of receiving.  Any expression that contains a call to ~receive~ becomes a "receiver" that carries the type of messages handled so if we have something like ~let x = receive with i, is_integer i -> i~, that entire expression is a receiver.  If a function contains it like this:

#+BEGIN_SRC
let f x =
  let x = receive with i, is_integer i -> i in
  i
#+END_SRC

then the entire function is considered a receiver too.

Mutually recursive functions can be spawned as well provided that *if* they're both receivers, the message receive types match:

#+BEGIN_SRC
let a () =
  receive with
      :b -> b ()
    | _ -> a ()

let b () =
  receive with
      "a" -> a ()
    | _ -> b ()

-- The above will fail compilation unless the following ADT is in scope:
type a_and_b = string | atom
#+END_SRC

As an aside, both the functions ~a/1~ and ~b/1~ above have the return type ~rec~, meaning "infinitely recursive" since neither ever return a value.  This is a legitimate type in Alpaca.
* Exporting and Importing Functions
There are a few handy shortcuts for exporting and importing functions to be aware of.  If you have different versions of a function (same name, different number of arguments) and you want to export them all, you can leave out the arity when exporting, e.g.

#+BEGIN_SRC
module example

-- this will export foo/1 and foo/2 for you:
export foo

let foo x = x

let foo x y = x + y
#+END_SRC

You can also import functions with or without arity, e.g. ~import example.foo/1~ for only the first ~foo~ in the example above or ~import example.foo~ for both versions.  Subsets of a module's functions can be imported in a list format as well, for example if we have a simple math helper module:

#+BEGIN_SRC
-- some simple math functions:
module math

export add, sub, mult

let add x y = x + y
let sub x y = x - y
let mult x y = x * y
#+END_SRC

We can then import two of the functions with a list:
#+BEGIN_SRC
-- imports and uses two of the math functions
module example

import math.[add, sub]

let f () = add 2 (sub 5 3)
#+END_SRC

When giving lists of functions to import you can include arity if you only want a specific version of a function.
